In [ ]:
%%capture

!pip install ipython-sql
!pip install databases
!pip install databases[sqlite]

In [ ]:
import sqlalchemy
%load_ext sql
%sql sqlite:///projectdb.db

In [ ]:
%%sql

  DROP TABLE IF EXISTS [Guest];
  CREATE TABLE [Guest] (
    [memberID] INTEGER PRIMARY KEY,
    [memberName] nvarchar(250) NOT NULL,
    [memberEmail] nvarchar(250),
    [memberAddress] nvarchar(250)
  );

  DROP TABLE IF EXISTS [Mail];
  CREATE TABLE [Mail] (
    [mailmaninfo] nvarchar(250)  ,
    [FastTrack] nvarchar(250),
    [updates] nvarchar(250)
  );

  DROP TABLE IF EXISTS [Tracking];
  CREATE TABLE [Tracking] (
    [trackingID] INTEGER PRIMARY KEY,
    [packageinfo] nvarchar(250),
    [updates] nvarchar(250)
  );

  DROP TABLE IF EXISTS [GuestPayInfo];
  CREATE TABLE [GuestPayInfo] (
    [memberID] INTEGER PRIMARY KEY,
    [memberCardName] nvarchar(250) NOT NULL,
    [memberCardNumber] [int],
    [memberCardExpiration] nvarchar(250),
    [memberCardCSV] [int],
    [trackingID] [int] ,
    [packageinfo] nvarchar(350)



  );


  DROP TABLE IF EXISTS [PostalStore];
  CREATE TABLE [PostalStore] (
    [storeID] INTEGER PRIMARY KEY,
    [phonenumber] [int]
    [street] nvarchar(250),
    [city] nvarchar(250),
    [state] nvarchar(250),
    [zipcode] [int],
    [contactID] [int]
  );

  DROP TABLE IF EXISTS [Recieve];
  CREATE TABLE [Recieve] (
    [packageinfo]  nvarchar(250),
    [mailmaninfo] nvarchar(250)


  );

  DROP TABLE IF EXISTS [contactUs];
  CREATE TABLE [contactUs] (
    [contactID]  INTEGER PRIMARY KEY,
    [phonenumber] [int],
    [chatwithagent] nvarchar(250)


  );

 * sqlite:///projectdb.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
print('Guest')
%sql pragma table_info('Guest');

Guest
 * sqlite:///projectdb.db
Done.

[(0, 'memberID', 'INTEGER', 0, None, 1),
 (1, 'memberName', 'nvarchar(250)', 1, None, 0),
 (2, 'memberEmail', 'nvarchar(250)', 0, None, 0),
 (3, 'memberAddress', 'nvarchar(250)', 0, None, 0)]

In [ ]:
print('Mail')
%sql pragma table_info('Mail');

Mail
 * sqlite:///projectdb.db
Done.

[(0, 'mailmaninfo', 'nvarchar(250)', 0, None, 0),
 (1, 'FastTrack', 'nvarchar(250)', 0, None, 0),
 (2, 'updates', 'nvarchar(250)', 0, None, 0)]

In [ ]:
print('Tracking')
%sql pragma table_info('Tracking');

Tracking
 * sqlite:///projectdb.db
Done.

[(0, 'trackingID', 'INTEGER', 0, None, 1),
 (1, 'packageinfo', 'nvarchar(250)', 0, None, 0),
 (2, 'updates', 'nvarchar(250)', 0, None, 0)]

In [ ]:
print('GuestPayInfo')
%sql pragma table_info('GuestPayInfo');

GuestPayInfo
 * sqlite:///projectdb.db
Done.

[(0, 'memberID', 'INTEGER', 0, None, 1),
 (1, 'memberCardName', 'nvarchar(250)', 1, None, 0),
 (2, 'memberCardNumber', 'int', 0, None, 0),
 (3, 'memberCardExpiration', 'nvarchar(250)', 0, None, 0),
 (4, 'memberCardCSV', 'int', 0, None, 0),
 (5, 'trackingID', 'int', 0, None, 0),
 (6, 'packageinfo', 'nvarchar(350)', 0, None, 0)]

In [ ]:
print('PostalStore')
%sql pragma table_info('PostalStore');

PostalStore
 * sqlite:///projectdb.db
Done.

[(0, 'storeID', 'INTEGER', 0, None, 1),
 (1, 'phonenumber', 'int', 0, None, 0),
 (2, 'city', 'nvarchar(250)', 0, None, 0),
 (3, 'state', 'nvarchar(250)', 0, None, 0),
 (4, 'zipcode', 'int', 0, None, 0),
 (5, 'contactID', 'int', 0, None, 0)]

In [ ]:
print('Recieve')
%sql pragma table_info('Recieve');

Recieve
 * sqlite:///projectdb.db
Done.

[(0, 'packageinfo', 'nvarchar(250)', 0, None, 0),
 (1, 'mailmaninfo', 'nvarchar(250)', 0, None, 0)]

In [ ]:
print('contactUs')
%sql pragma table_info('contactUs');

contactUs
 * sqlite:///projectdb.db
Done.

[(0, 'contactID', 'INTEGER', 0, None, 1),
 (1, 'phonenumber', 'int', 0, None, 0),
 (2, 'chatwithagent', 'nvarchar(250)', 0, None, 0)]

In [ ]:
%%sql

INSERT INTO Guest([memberID],[memberName],[memberEmail],[memberAddress]) VALUES (5321,'David Koslicki','jht337@psu.edu','6337 N Albany Ave, Chicago, IL 60103');
INSERT INTO Guest([memberID],[memberName],[memberEmail],[memberAddress]) VALUES (4562, 'Sophia Zane','sza756@psu.edu','657 Fox Ave, Memphis, TN 56412');
INSERT INTO Guest([memberID],[memberName],[memberEmail],[memberAddress]) VALUES (3232, 'Austin Green','aug234@psu.edu','587 Bulverde Pkwy, Birmingham, AL 54896');
INSERT INTO Guest([memberID],[memberName],[memberEmail],[memberAddress]) VALUES (3920,'Jonathan Sidwell',NULL,NULL);
INSERT INTO Guest([memberID],[memberName],[memberEmail],[memberAddress]) VALUES (2343,'Harvey Specter','sdb@gmail.com',NULL);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM Guest;

 * sqlite:///projectdb.db
Done.

[(2343, 'Harvey Specter', 'sdb@gmail.com', None),
 (3232, 'Austin Green', 'aug234@psu.edu', '587 Bulverde Pkwy, Birmingham, AL 54896'),
 (3920, 'Jonathan Sidwell', None, None),
 (4562, 'Sophia Zane', 'sza756@psu.edu', '657 Fox Ave, Memphis, TN 56412'),
 (5321, 'David Koslicki', 'jht337@psu.edu', '6337 N Albany Ave, Chicago, IL 60103')]

In [ ]:
%%sql

INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('MKG6773','Y','Shipped');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('DEH3566','N','Delivered');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('PFK6232','N','Product recieved');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('MKG6773','Y','Shipped');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('YEK9238','N','Shipped');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('MKG6773','Y','Delivered');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('WER4565','Y','Shipped');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('PFK6232','N','Product recieved');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('TGK8999','Y','Delivered');
INSERT INTO Mail([mailmaninfo],[FastTrack],[updates]) VALUES ('PFK6232','Y','Delivered');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM Mail;

 * sqlite:///projectdb.db
Done.

[('MKG6773', 'Y', 'Shipped'),
 ('DEH3566', 'N', 'Delivered'),
 ('PFK6232', 'N', 'Product recieved'),
 ('MKG6773', 'Y', 'Shipped'),
 ('YEK9238', 'N', 'Shipped'),
 ('MKG6773', 'Y', 'Delivered'),
 ('WER4565', 'Y', 'Shipped'),
 ('PFK6232', 'N', 'Product recieved'),
 ('TGK8999', 'Y', 'Delivered'),
 ('PFK6232', 'Y', 'Delivered')]

In [ ]:
%%sql

INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (23429438291,'Heavy','Shipped');
INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (21123123293,'Light','Delivered');
INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (49499230211,'Heavy','Package recieved');
INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (93847272173,'Heavy','Shipped');
INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (74727173721,'Light','Shipped');
INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (64664278283,'Light','Shipped');
INSERT INTO Tracking([trackingID],[packageinfo],[updates]) VALUES (53423123123,'Heavy','Delivered');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM Tracking;

 * sqlite:///projectdb.db
Done.

[(21123123293, 'Light', 'Delivered'),
 (23429438291, 'Heavy', 'Shipped'),
 (49499230211, 'Heavy', 'Package recieved'),
 (53423123123, 'Heavy', 'Delivered'),
 (64664278283, 'Light', 'Shipped'),
 (74727173721, 'Light', 'Shipped'),
 (93847272173, 'Heavy', 'Shipped')]

In [ ]:
%%sql

INSERT INTO GuestPayInfo([memberID],[memberCardName],[memberCardNumber],[memberCardExpiration],[memberCardCSV],[trackingID],[packageinfo]) VALUES (5321,'David Sam Koslicki',5542123685429647,'06/27',516,23429438291,'Heavy');
INSERT INTO GuestPayInfo([memberID],[memberCardName],[memberCardNumber],[memberCardExpiration],[memberCardCSV],[trackingID],[packageinfo]) VALUES (4562,'Sophia Racheal Zane',6422125485641345,'04/22',145,21123123293,'Light');
INSERT INTO GuestPayInfo([memberID],[memberCardName],[memberCardNumber],[memberCardExpiration],[memberCardCSV],[trackingID],[packageinfo]) VALUES (3232,'Austin F Green',1452125456412341,'03/23',615,49499230211,'Heavy');
INSERT INTO GuestPayInfo([memberID],[memberCardName],[memberCardNumber],[memberCardExpiration],[memberCardCSV],[trackingID],[packageinfo]) VALUES (3920,'Jonathan G Sidwell',2514563285469874,'02/22',713,93847272173,'Heavy');
INSERT INTO GuestPayInfo([memberID],[memberCardName],[memberCardNumber],[memberCardExpiration],[memberCardCSV],[trackingID],[packageinfo]) VALUES (2343,'Harvey Specter',8524125687459654,'03/25',598,64664278283,'Light')

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM GuestPayInfo;

 * sqlite:///projectdb.db
Done.

[(2343, 'Harvey Specter', 8524125687459654, '03/25', 598, 64664278283, 'Light'),
 (3232, 'Austin F Green', 1452125456412341, '03/23', 615, 49499230211, 'Heavy'),
 (3920, 'Jonathan G Sidwell', 2514563285469874, '02/22', 713, 93847272173, 'Heavy'),
 (4562, 'Sophia Racheal Zane', 6422125485641345, '04/22', 145, 21123123293, 'Light'),
 (5321, 'David Sam Koslicki', 5542123685429647, '06/27', 516, 23429438291, 'Heavy')]

In [ ]:
%%sql

INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (5065652,3215231542,'Chicago','IL',60103,53215);
INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (8051273,5112536524,'San Antonio','TX',78259,22254);
INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (5850208,6541221551,'State College','PA',16801,8824);
INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (3202015,7541312544,'Columbus','OH',43004,5591);
INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (1320055,7415238459,'Houston','TX',77001,9955);
INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (3001525,8412516656,'Dallas','TX',75001,55615);
INSERT INTO PostalStore([storeID],[phonenumber],[city],[state],[zipcode],[contactID]) VALUES (5600651,8451235486,'West Chester','PA',19380,8624)

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM PostalStore;

 * sqlite:///projectdb.db
Done.

[(1320055, 7415238459, 'Houston', 'TX', 77001, 9955),
 (3001525, 8412516656, 'Dallas', 'TX', 75001, 55615),
 (3202015, 7541312544, 'Columbus', 'OH', 43004, 5591),
 (5065652, 3215231542, 'Chicago', 'IL', 60103, 53215),
 (5600651, 8451235486, 'West Chester', 'PA', 19380, 8624),
 (5850208, 6541221551, 'State College', 'PA', 16801, 8824),
 (8051273, 5112536524, 'San Antonio', 'TX', 78259, 22254)]

In [ ]:
%%sql

INSERT INTO Recieve([packageinfo],[mailmaninfo]) VALUES ('Heavy','PFK6232');
INSERT INTO Recieve([packageinfo],[mailmaninfo]) VALUES ('Heavy','MKG6773');
INSERT INTO Recieve([packageinfo],[mailmaninfo]) VALUES ('Light','PFK6232');
INSERT INTO Recieve([packageinfo],[mailmaninfo]) VALUES ('Heavy','YEK9238');
INSERT INTO Recieve([packageinfo],[mailmaninfo]) VALUES ('Heavy','WER4565')

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM Recieve;

 * sqlite:///projectdb.db
Done.

[('Heavy', 'PFK6232'),
 ('Heavy', 'MKG6773'),
 ('Light', 'PFK6232'),
 ('Heavy', 'YEK9238'),
 ('Heavy', 'WER4565')]

In [ ]:
%%sql

INSERT INTO contactUs([contactID],[phonenumber],[chatwithagent]) VALUES (53215,6309438194,'jfh456@usps.com');
INSERT INTO contactUs([contactID],[phonenumber],[chatwithagent]) VALUES (22254,3215231542,'wne868@usps.com');
INSERT INTO contactUs([contactID],[phonenumber],[chatwithagent]) VALUES (8824,6541221551,'aew128@usps.com');
INSERT INTO contactUs([contactID],[phonenumber],[chatwithagent]) VALUES (5591,7541312544,'gte435@usps.com')

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM contactUs;

 * sqlite:///projectdb.db
Done.

[(5591, 7541312544, 'gte435@usps.com'),
 (8824, 6541221551, 'aew128@usps.com'),
 (22254, 3215231542, 'wne868@usps.com'),
 (53215, 6309438194, 'jfh456@usps.com')]

In [ ]:
%%sql
SELECT storeID, zipcode, city
FROM PostalStore
WHERE state == 'TX'

 * sqlite:///projectdb.db
Done.

[(1320055, 77001, 'Houston'),
 (3001525, 75001, 'Dallas'),
 (8051273, 78259, 'San Antonio')]

In [ ]:
%%sql
SELECT *
FROM Mail
WHERE mailmaninfo == 'PFK6232'

 * sqlite:///projectdb.db
Done.

[('PFK6232', 'N', 'Product recieved'),
 ('PFK6232', 'N', 'Product recieved'),
 ('PFK6232', 'Y', 'Delivered')]

In [ ]:
%%sql
SELECT *
FROM Mail
WHERE mailmaninfo == 'PFK6232' and FastTrack=='Y'

 * sqlite:///projectdb.db
Done.

[('PFK6232', 'Y', 'Delivered')]

In [ ]:
%%sql
SELECT storeID, zipcode, city
FROM PostalStore
ORDER BY city DESC

 * sqlite:///projectdb.db
Done.

[(5600651, 19380, 'West Chester'),
 (5850208, 16801, 'State College'),
 (8051273, 78259, 'San Antonio'),
 (1320055, 77001, 'Houston'),
 (3001525, 75001, 'Dallas'),
 (3202015, 43004, 'Columbus'),
 (5065652, 60103, 'Chicago')]

In [ ]:
%%sql

SELECT *
FROM Guest
NATURAL JOIN GuestPayInfo;

 * sqlite:///projectdb.db
Done.

[(2343, 'Harvey Specter', 'sdb@gmail.com', None, 'Harvey Specter', 8524125687459654, '03/25', 598, 64664278283, 'Light'),
 (3232, 'Austin Green', 'aug234@psu.edu', '587 Bulverde Pkwy, Birmingham, AL 54896', 'Austin F Green', 1452125456412341, '03/23', 615, 49499230211, 'Heavy'),
 (3920, 'Jonathan Sidwell', None, None, 'Jonathan G Sidwell', 2514563285469874, '02/22', 713, 93847272173, 'Heavy'),
 (4562, 'Sophia Zane', 'sza756@psu.edu', '657 Fox Ave, Memphis, TN 56412', 'Sophia Racheal Zane', 6422125485641345, '04/22', 145, 21123123293, 'Light'),
 (5321, 'David Koslicki', 'jht337@psu.edu', '6337 N Albany Ave, Chicago, IL 60103', 'David Sam Koslicki', 5542123685429647, '06/27', 516, 23429438291, 'Heavy')]

In [ ]:
%%sql

SELECT *
FROM Guest
LEFT JOIN GuestPayInfo gpi ON Guest.memberID = gpi.memberID

 * sqlite:///projectdb.db
Done.

[(2343, 'Harvey Specter', 'sdb@gmail.com', None, 2343, 'Harvey Specter', 8524125687459654, '03/25', 598, 64664278283, 'Light'),
 (3232, 'Austin Green', 'aug234@psu.edu', '587 Bulverde Pkwy, Birmingham, AL 54896', 3232, 'Austin F Green', 1452125456412341, '03/23', 615, 49499230211, 'Heavy'),
 (3920, 'Jonathan Sidwell', None, None, 3920, 'Jonathan G Sidwell', 2514563285469874, '02/22', 713, 93847272173, 'Heavy'),
 (4562, 'Sophia Zane', 'sza756@psu.edu', '657 Fox Ave, Memphis, TN 56412', 4562, 'Sophia Racheal Zane', 6422125485641345, '04/22', 145, 21123123293, 'Light'),
 (5321, 'David Koslicki', 'jht337@psu.edu', '6337 N Albany Ave, Chicago, IL 60103', 5321, 'David Sam Koslicki', 5542123685429647, '06/27', 516, 23429438291, 'Heavy')]

In [ ]:
%%sql

SELECT *
FROM GuestPayInfo

 * sqlite:///projectdb.db
Done.

[(2343, 'Harvey Specter', 8524125687459654, '03/25', 598, 64664278283, 'Light'),
 (3232, 'Austin F Green', 1452125456412341, '03/23', 615, 49499230211, 'Heavy'),
 (3920, 'Jonathan G Sidwell', 2514563285469874, '02/22', 713, 93847272173, 'Heavy'),
 (4562, 'Sophia Racheal Zane', 6422125485641345, '04/22', 145, 21123123293, 'Light'),
 (5321, 'David Sam Koslicki', 5542123685429647, '06/27', 516, 23429438291, 'Heavy')]

In [ ]:
%%sql

UPDATE GuestPayInfo
SET packageinfo='Heavy Duty'
WHERE trackingID=93847272173

 * sqlite:///projectdb.db
1 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM GuestPayInfo

 * sqlite:///projectdb.db
Done.

[(2343, 'Harvey Specter', 8524125687459654, '03/25', 598, 64664278283, 'Light'),
 (3232, 'Austin F Green', 1452125456412341, '03/23', 615, 49499230211, 'Heavy'),
 (3920, 'Jonathan G Sidwell', 2514563285469874, '02/22', 713, 93847272173, 'Heavy Duty'),
 (4562, 'Sophia Racheal Zane', 6422125485641345, '04/22', 145, 21123123293, 'Light'),
 (5321, 'David Sam Koslicki', 5542123685429647, '06/27', 516, 23429438291, 'Heavy')]